Revit 2026 API

# ElementTransformUtilsCopyElements(View, ICollectionElementId, View, Transform, CopyPasteOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> CopyElements(
	View sourceView,
	ICollection<ElementId> elementsToCopy,
	View destinationView,
	Transform additionalTransform,
	CopyPasteOptions options
)
```
```vb
Public Shared Function CopyElements (
	sourceView As View,
	elementsToCopy As ICollection(Of ElementId),
	destinationView As View,
	additionalTransform As Transform,
	options As CopyPasteOptions
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ CopyElements(
	View^ sourceView,
	ICollection<ElementId^>^ elementsToCopy,
	View^ destinationView,
	Transform^ additionalTransform,
	CopyPasteOptions^ options
)
```
```fsharp
static member CopyElements :
        sourceView : View *
        elementsToCopy : ICollection<ElementId> *
        destinationView : View *
        additionalTransform : Transform *
        options : CopyPasteOptions -> ICollection<ElementId>
```

#### Parameters

sourceView View

elementsToCopy ICollectionElementId

destinationView View

additionalTransform Transform

options CopyPasteOptions

#### Return Value

ICollectionElementId

#### Reference

ElementTransformUtils Class

CopyElements Overload

Autodesk.Revit.DB Namespace